In [1]:
import pandas as pd
import numpy as np
import os
from pprint import pprint

In [3]:
#Задание №1
data = pd.read_csv(os.getcwd() + '/ratings.csv')
data.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [33]:
data[data['rating'] == 5.0][['movieId', 
                             'rating']].groupby(['movieId']).count().sort_values(by='rating', 
                                                                                 ascending=False)

         rating
movieId
318         153
296         123
356         116
2571        109
260         104
...         ...
6732          1
6731          1
6713          1
2066          1
187717        1

[2954 rows x 1 columns]

In [38]:
#Задание №2
data = pd.read_csv(os.getcwd() + '/power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [49]:
#v1
data[((data['country'] == 'Latvia')|(data['country'] == 'Estonia')|(data['country'] == 'Lithuania'))
     & ((data['category'] == 4)|(data['category'] == 12)|(data['category'] == 21))
     & ((data['year'] >= 2005)|(data['year'] <= 2010))
     & (data['quantity'] >= 0.0)]['quantity'].sum()

970728.0

In [55]:
#v2
data[data['country'].isin(['Latvia', 'Estonia', 'Lithuania'])
    & data['category'].isin([4, 12, 21])
    & ((data['year'] >= 2005)|(data['year'] <= 2010))]['quantity'].sum()

970605.0

In [34]:
#Задание №3
page_url = 'https://cbr.ru/currency_base/daily/'

# Импортируем нужную нам страницу в df
# attrs = {'class': 'news_table'} ---> указываем какой именно блок нам нужен
# encoding='utf-8' ---> указываем кодировку страниц для корректного отображения кириллицы
data = pd.read_html(page_url)#, attrs = {'class': 'data'}, encoding='utf-8')
data[0].info()
data[0].head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34 entries, 0 to 33
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Цифр. код  34 non-null     int64
 1   Букв. код  34 non-null     object
 2   Единиц     34 non-null     int64
 3   Валюта     34 non-null     object
 4   Курс       34 non-null     int64
dtypes: int64(3), object(2)
memory usage: 1.5+ KB

   Цифр. код Букв. код  Единиц                 Валюта    Курс
0         36       AUD       1   Австралийский доллар  578082
1        944       AZN       1  Азербайджанский манат  440622
2         51       AMD     100       Армянских драмов  143722
3        933       BYN       1      Белорусский рубль  292371
4        975       BGN       1         Болгарский лев  458880